
## Plan Result (repository)

[CI link](https://github.com/tqer39/terraform-github/actions/runs/4589616590)


<pre><code>Plan: 2 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.tqer39.github_branch.this[&#34;main&#34;]
  * module.tqer39.github_branch_protection.this[&#34;main&#34;]
* Update
  * module.tqer39.github_repository.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.tqer39.github_branch.this["main"] will be created
  + resource "github_branch" "this" {
      + branch        = "main"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "tqer39"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.tqer39.github_branch_protection.this["main"] will be created
  + resource "github_branch_protection" "this" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "tqer39"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + strict = true
        }
    }

  # module.tqer39.github_repository.this will be updated in-place
  ~ resource "github_repository" "this" {
        id                          = "tqer39"
        name                        = "tqer39"
      + topics                      = [
          + "managed-by-terraform-github",
        ]
        # (32 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":10,"Program":"tfcmt","SHA1":"ba974a26484c4269659048ace222f4df3bc8f79c","Target":"repository","Vars":{},"WorkflowName":"Terraform - AWS - Portfolio"} -->